In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_excel("Professional.xlsx")

In [3]:
data.head()

     date  total_attacks
0  2001-5             13
1  2002-1             13
2  2003-6             50
3  2003-8             50
4  2007-4             43

In [4]:
data.tail()

       date  total_attacks
119  2023-1             18
120  2023-3             43
121  2023-4              9
122  2023-6            516
123  2023-8             17

In [5]:
data.describe()

       total_attacks
count     124.000000
mean       33.491935
std        54.393253
min         0.000000
25%         8.000000
50%        17.000000
75%        41.500000
max       516.000000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 124 entries, 0 to 123
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           124 non-null    object
 1   total_attacks  124 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.1+ KB

In [7]:
data['date']=data['date'].apply(pd.to_datetime)

In [8]:
data.head()

        date  total_attacks
0 2001-05-01             13
1 2002-01-01             13
2 2003-06-01             50
3 2003-08-01             50
4 2007-04-01             43

In [9]:
data.sort_values(by='date',inplace=True)

In [10]:
data=data.reset_index(drop=True)

In [11]:
data.tail(10)

          date  total_attacks
114 2022-04-01              5
115 2022-06-01              8
116 2022-09-01              4
117 2022-10-01             32
118 2022-11-01              1
119 2023-01-01             18
120 2023-03-01             43
121 2023-04-01              9
122 2023-06-01            516
123 2023-08-01             17

In [12]:
def map_count_to_state(count):
    if count == 0:
        return 0
    elif 1 <= count <= 5:
        return 1
    elif 6 <= count <= 10:
        return 2
    else:
        return 3

# Apply the mapping function to your attack counts
data['state'] = data['total_attacks'].apply(map_count_to_state)

# Create an empty transition matrix based on the number of states
num_states = data['state'].max() + 1
transition_matrix = np.zeros((num_states, num_states))

# Count the transitions
for i in range(len(data) - 1):
    current_state = data['state'].iloc[i]
    next_state = data['state'].iloc[i + 1]
    transition_matrix[current_state][next_state] += 1

# Normalize the counts to probabilities
for i in range(num_states):
    total = np.sum(transition_matrix[i])
    if total > 0:
        transition_matrix[i] /= total

# Output the transition matrix
transition_matrix_df = pd.DataFrame(transition_matrix)
print(transition_matrix_df)

          0         1         2         3
0  0.000000  0.000000  0.000000  1.000000
1  0.000000  0.166667  0.208333  0.625000
2  0.000000  0.416667  0.166667  0.416667
3  0.011628  0.174419  0.058140  0.755814